{
  "": "Các thực từ chưa được phân loại",
  "Nr": "Tên/họ riêng của người, như Trương Tam, Joe hay Kazuto.",
  "Nh": "Cấu trúc họ người + danh xưng",
  "Nt": "Danh hiệu, nick name của cá nhân",
  "Na": "Đồng thời là địa danh/tổ chức hoặc chưa rõ là địa danh hay tổ chức",
  "Nal": "Tên riêng của địa danh, khu vực, địa điểm cụ thể",
  "Nag": "Tên riêng của tổ chức, cơ quan, bang phái",
  "Nw": "Tên tựa sách, phim, truyện, thơ văn...",
  "Nl": "Tên nhãn hiệu như Gucci, adidas, Porche. Có tính chất của nơi sở thuộc + thuộc tính",
  "Nz": "Các tên riêng khác như chiêu thức, dược phẩm, công thức hoá học",
  "n": "Danh từ thông dụng như tên động vật, đồ vật hoặc các khái niệm trừu tượng",
  "nh": "Danh xưng cho người như tỷ tỷ, muội muội, đại nhân, lão sư, tiểu thư",
  "na": "Danh từ chỉ màu sắc, đặc điểm nhận dạng, phân chia cấp độ...",
  "ns": "Từ chỉ nơi chốn của đồ vật như trên bàn, dưới núi, trong thư viện",
  "nf": "Các danh từ chỉ phương hướng như phía trên, bên dưới, đằng sau, ở giữa",
  "nt": "Các từ chỉ thời gian như buổi sáng, 12 giờ, thứ hai, tháng 7, năm 2021",
  "nc": "Danh từ chỉ khái niệm, sự vật, hiện tượng vô hình không cầm nắm được",
  "nv": "Danh từ chỉ các vật còn sống như động vật, thực vật...",
  "no": "Danh từ chỉ các vật chết như cái bàn, thanh đao, đôi dép...",
  "a": "Các từ mô tả hình dạng/tính chất của sự vật, hoặc trạng thái của hành vi",
  "ab": "Tính từ phi vị ngữ, có thể làm định ngữ trực tiếp cho danh từ không cần 的",
  "al": "Các cụm từ, thành ngữ mang vai trò tính từ trong câu",
  "az": "Từ chỉ trạng thái như ướt sùng sũng, đo đỏ. Các tính từ dạng lặp",
  "ad": "Từ vừa đóng vai trò tính từ vừa có thể là trạng từ (cho động từ)",
  "an": "Từ vừa đóng vai trò tính từ vừa có thể là danh từ",
  "av": "Từ vừa đóng vai trò tính từ vừa có thể là (ngoại) động từ",
  "v": "Từ chỉ động tác, hành vi, biến hoá, phát triển. Đằng sau cần một hoặc 2 tân ngữ",
  "vd": "Những từ vừa có vai trò là động từ vừa có thể làm phó từ (trạng ngữ)",
  "vn": "Từ vừa đóng vai trò động từ vừa có thể là danh từ",
  "vi": "Các động từ không cần thiết tân ngữ (đối tượng) phía sau",
  "vj": "Các từ vừa là nội động từ vừa là ngoại động từ",
  "vf": "Vừa là động từ vừa là bổ ngữ cho động từ, biểu thị xu hướng của động tác như lên, xuống, ra, vào...",
  "vx": "Có thể kết hợp bổ nghĩa cho động từ phía sau.",
  "vm": "Trợ động từ biểu đạt năng lực, nguyện vọng, yêu cầm, khả năng của một việc",
  "rr": "Đại từ chỉ ngôi thứ nhất, thứ hai hoặc thứ ba. Ví dụ ta, ngươi, hắn, trẫm, ngài",
  "rz": "Các từ này, kia hoặc này/kia + lượng từ",
  "ry": "Đại từ nghi vấn",
  "r": "Đại từ chưa phân loại",
  "nl": "Các cấu trúc kết hợp danh từ với số lượng từ hoặc đại từ chỉ thị ở đằng trước",
  "vo": "Cấu trúc gồm một động từ + một danh từ, có thể làm định ngữ, bổ ngữ hoặc động từ li hợp",
  "i": "Các cụm từ thường gặp nhưng chưa được phân loại sang danh/động/tính",
  "m": "Các từ chỉ số lượng như một hai vạn ức, 1 2 3...",
  "q": "Biểu thị đơn vị của sự vật hoặc động tác, ví dụ chiếc, con, quyển...",
  "mq": "Các cụm từ là kết hợp của số từ và lượng từ",
  "qx": "Các từ có thể là lượng từ cũng có thể là từ loại khác",
  "mqx": "Các từ có thể là số lượng từ cũng có thể là từ loại khác",
  "d": "Từ đặt trước động từ, tính từ đẻ làm trạng ngữ",
  "c": "Liên từ là những hư từ dùng để liên kết từ với từ, cụm từ với cụm từ hoặc câu với câu",
  "cc": "Các liên từ mang nghĩa liệt kê các từ tương đương, ví dụ 'và', 'với', 'cùng'...",
  "p": "Các từ có thể tổ hợp với các từ khác làm cụm giới từ làm định ngữ hoặc trạng ngữ",
  "u": "Các từ đi kèm với từ, cụm từ hoặc câu để bổ trợ cho tác dụng của từ",
  "kn": "Hậu tố danh từ (đã quá hạn)",
  "ka": "Hậu tố tính từ (đã quá hạn)",
  "kv": "Hậu tố động từ (đã quá hạn)",
  "k": "Các từ đặt sau danh/động/tính, bổ sung ý nghĩa cho từ phía trước hoặc biến đổi từ loại",
  "kx": "Các từ có thể là hậu tố cũng có thể là từ loại khác",
  "kl": "Các cụm từ có thể kết hợp với từ đằng trước tạo ra từ mới",
  "x": "Các chữ cái ngoại lai chưa được phân loại",
  "xx": "Dùng để ký hiệu các cụm từ emoji/kaomoji",
  "xl": "Siêu liên kết (link) tới các trang web khác",
  "xe": "Từ biểu thị cảm thán, kêu gọi, hò hét, đối đáp",
  "xo": "Những từ mô phỏng âm thanh, tiếng động",
  "xy": "Trợ từ ngữ khí: vừa là trợ từ vừa là thán từ",
  "xq": "Trích đoạn thơ, văn xuôi, danh ngôn...",
  "xt": "Đoạn dịch tay không có phân loại cụ thể",
  "w": "Các loại dấu câu như chấm hỏi, chấm than, hai chấm, ba chấm...",
  "!": "Các từ được xử lý đặc biệt trong máy dịch",
  "~ap": "Dùng trong máy dịch: Cụm từ đóng vai trò tính từ",
  "~vp": "Dùng trong máy dịch: Cụm từ đóng vai trò động từ",
  "~np": "Dùng trong máy dịch: Cụm từ đóng vai trò danh từ",
  "~dp": "Dùng trong máy dịch: Cụm từ đóng vai trò định ngữ",
  "~pn": "Dùng trong máy dịch: Cụm từ gồm giới từ + danh từ",
  "~sv": "Dùng trong máy dịch: Cụm chủ + vị (động)",
  "~na": "Dùng trong máy dịch: Cụm danh từ + tính từ"
}
