module CV::MTL
  VERB_COMPLS = {
    "得到" => "tới",
    "到"  => "đến",
    "向"  => "hướng",
    # "在"  => "ở",
    "见"  => "thấy",
    "着"  => "được",
    "住"  => "lấy",
    "回"  => "trở về"
    "不住" => "không nổi",
    "上"  => "lên",
    "开"  => "ra",
    "完"  => "xong",
    "好"  => "xong",
    "错"  => "sai",
    # "对"  => "đúng",
    "成" => "thành",
    "懂" => "hiểu",
    "掉" => "mất",
    "走" => "đi",
    "够" => "đủ",
    "满" => "đầy",
    "倒" => "đổ",
    "下" => "xuống",
    "起" => "lên",
    "给" => "cho",
  }
end
